# Создайте программу для игры с конфетами человек против бота.
# Условие задачи: На столе лежит 120 конфета. Играют два игрока делая ход друг после друга.
# Первый ход делает человек. За один ход можно забрать не более чем 28 конфет.
# Победитель - тот, кто оставил на столе 0 конфет.

print('Есть 120 конфет за раз можно взять не больше 28 конфет.Выигрывает тот, кто оставил на столе 0 конфет')